beer-me/server/app/controllers/beers_controller.rb

	def show
		@locations = Location.where(zip_code: params[:id])
		@beers_array = []
		@locations.each do |bar|
			@beers_array << bar.beers
		end

		@beers_array.flatten!
		@beers = []
		@beers_array.each do |beer|
			@beers << {
				name: beer.name,
				abv: beer.abv,
				rank: beer.locations.count,
				price: beer.price,
				locations: beer.locations
---
SELECT "locations".* FROM "locations" WHERE "locations"."zip_code" = $1  [["zip_code", 94110]]
SELECT "locations".* FROM "locations" INNER JOIN "beers_locations" ON "locations"."id" = "beers_locations"."location_id" WHERE "beers_locations"."beer_id" = $1  [["beer_id", 1]]
SELECT COUNT(*) FROM "locations" INNER JOIN "beers_locations" ON "locations"."id" = "beers_locations"."location_id" WHERE "beers_locations"."beer_id" = $1  [["beer_id", 1]]